#pragma once
#include <iostream>

//source: https://www.lztai.com/xs/201903/45010.html

namespace ACG_Sentences{
    const int size=15;
    std::string acg_sentences[15]={
        "有一种友情，叫做《海贼王》；有一种治愈，叫做《夏目友人帐》；有一种执着，叫做《火影忍者》；有一种坚持，叫做《命运石之门》；有一种凄美，叫做《薄樱鬼》；有一种青春，叫做《灌篮高手》；有一种欢乐，叫做《樱兰高校男公关部》；有一种感动,叫做《CLANNAD》；有一种邪恶，叫做《亲吻姐姐》；有一种火焰，叫做《家庭教师》；有一种爱情，叫做《刀剑神域》；有一种坚强，叫做《神魔遮天》；有一种感人，叫做《最终幻想》；有一种热血，叫做《妖精的尾巴》；有一种牺牲，叫做《叛逆的鲁鲁修》；有一种梦想，叫做《食梦者玛丽》；有一个神话，叫做《AngelBeats！》；有一种守护，叫做《死神》；有一种梦想，叫做《网球王子》；有一种童年，叫做《哆来A梦》；有一种固执，叫做《通灵王》；有一种轮回，叫做《名侦探柯南》；有一种唯美，叫做《黑执事》；有一种华丽，叫做《吸血鬼骑士》；有一种悲情，叫做《罪恶王冠》；有一种心痛，叫做《萤火之森》；有一种天真，叫做《中二病也要谈恋爱》；有一种人性，叫做《尸鬼》；有一种宿命，叫做《X战记》；有一种命运，叫做《Fate系列》；有一种真实，叫做《地狱少女》；有一种眷恋，叫做《犬夜叉》；有一种纯真，叫做《风之谷》；有一种坚持，叫做《大剑》；有一种温柔，叫做《蔷薇少女》；有一种心情，叫做《好想告诉你》；有一种智商，叫做《死亡笔记》；有一种怀疑，叫做《K》；有一种交换，叫做《钢之炼金术师》有一种羁绊，叫做《最游记》；有一种纯情，叫做《只要你说你爱我》；有一种逆袭，叫做《加速世界》；有一种无奈，叫做《未闻花名》；有一种缘分，叫做《元气少女缘结神》；有一种绝望，叫做《弹丸论破》；有一种畸恋，叫做《缘之空》；有一种音乐，叫做《轻音少女》；有一种天使，叫做《天降之物》；有一种战士，叫做《EVA》；有一种管家，叫做《旋风管家》；有一种萝莉，叫做《灼眼的夏娜》；有一种契约，叫做《零之使魔》；有一种巧合，叫做《龙与虎》；有一种抑郁，叫做《我们的存在》；有一种基情，叫做《世界第一初恋》；有一种初恋，叫做《秒速五厘米》；有一种完美，叫做《会长是女仆大人》；有一种孤独，叫做《我的朋友很少》；有一种喜爱，叫做动漫；有一种美好，叫做二次元",
        "有一种信念,叫做《新撰组异闻录》；有一种执着，叫做《浪客剑心》；有一种懵懂，叫做《东京巴比伦》；有一种伪娘，叫做《乱马二分之一》；有一种纯真，叫做《棒球英豪》；有一种寻求，叫做《全职猎人》；有一种伤逝，叫做《棋魂》；有一种信任，叫做《幽游白书》；有一种穿越，叫做《不思议游戏》；有一种政治，叫做《天是红河岸》；有一种倚靠，叫做《毒伯爵该隐》；有一种信任，叫做《恐怖宠物店》；有一种救赎，叫做《圣传》；有一种自由，叫做《圣子到》；有一种温馨，叫做《吉祥寺咖啡屋》；有一种努力，叫做《史上最强弟子兼一》；有一种原罪，叫做《妖精的旋律》；有一种颠覆，叫做《封神演义》；有一种吐嘈，叫做《银魂》；有一种变身，叫做《美少女战士》；有一种敬业，叫做《四驱小子》；有一种机智，叫做《聪明的一休》；有一种遗忘，叫做《少年阴阳师》；有一种搭档，叫做《逮捕令》；有一种魔幻，叫做《中华小当家》；有一种动容，叫做《AIR》；有一种怨念，叫做《下一站，巨星》；有一种爆发，叫做《圣斗士星矢》；有一种告别，叫做《魔神英雄坛》；有一种清新，叫做《虫师》；有一种悲惨，叫做《甲贺忍法帖》；有一种温情，叫做《死后文》；有一种责任，叫做《滑头鬼之孙》；有一种修行，叫做《少年金米》；有一种幸福，叫做《梦色糕点师》；有一种夺回，叫做《闪灵二人组》；有一种怀念，叫做《翼》；有一种成长，叫做《结界师》；有一种配合，叫做《噬魂师》；有一种改变，叫做《遥远时空中》；有一种优雅，叫做《金色琴弦》；有一种国漫，叫做《秦时明月》",
        "《黑执事》：时间能冲淡痛苦，但是，我并不想用时间来治愈一切。",
        "呐呐呐",
        "《火影忍者》：我们一直在一起，所以最后也想在你身旁。",
        "二次元在你心中有多重？” “三百克。” “原来那么轻啊，我还以为你有多爱二次元呢” “一个人的心脏只有三百克。",
        "因为你不混二次元 所以你不知道最感人的告白是[带我回家]\n因为你不混二次元 所以你不知道最沉重的誓言是[你要是消失，至少我会发现]\n因为你不混二次元，所以你不知道墨镜和笑容是最好的面具\n因为你不混二次元，所以你不知道沾染了鲜血的海棠才最美艳\n因为你不混二次元，所以你不知道被人当成怪物的孩子有多孤独\n因为你不混二次元，所以你不知道一夜之间从天堂掉入地狱有多绝望\n因为你不混二次元，所以你不知道信念可以爆发出战胜一切的力量\n因为你不混二次元，所以你不知道保护同伴的觉悟可以点燃焚尽一切的火焰\n因为你不混二次元，所以你不知道同样孤独的人如何相生相依",
        "看了《好想告诉你》知道了性格不是问题；看了《进击的巨人》知道了身高不是问题；看了《白兔糖》知道了年龄不是问题；看了《缘之空》知道了血缘不是问题；看了《世界第一初恋》知道了性别不是问题；看了《黑执事》知道了种族不是问题；看了《未闻花名》，知道了死活都不是问题！",
        "『一起去唱歌吧』\n「不了，我要回家看动漫」\n『一起吃饭去吧』\n「不了，我要去漫展」\n『一起喝杯咖啡吧』\n「不了，我要攒钱买手办」\n『你总这样活该单身』\n「我的爱人在动漫里」\n『你总是说你要去日本 你去那里干什么啊』\n「找东西」\n『找什么啊？』\n「我丢在那里的青春和我爱的二次元」",
        "我永远不会忘记有个词叫天真无邪.\n我永远不会忘记有位少爷叫夏尔.\n我永远不会忘记有只狐妖叫巴卫.\n我永远不会忘记有种身高叫一米六.\n我永远不会忘记有个小受叫黑子哲也.\n我永远不会忘记有种病叫做中二.\n我永远不会忘记有个播放器叫哔哩哔哩.\n我永远不会忘记有种美好叫二次元.\n能认识你们，真的是太好了",
        "如果能和初音一起歌唱；\n如果能和兵长一起杀巨人；\n如果能和路飞一起航海；\n如果能和夏目一起与妖怪嬉戏玩耍；\n如果能和黑子、火神一起搞搞基，打打篮球；\n如果能和陆生一起百鬼夜行；\n如果能和凉宫春日一起找外星人；\n如果真的有如果的话……\n此生不悔，来世仍愿",
        "三次元，只要你不跟风我们还是朋友。三次元，只要你不装逼我们还是朋友。三次元，只要你不黑进击我们还是朋友。三次元，只要你不转我进击我们还是朋友。三次元，只要你不黑我本命我们还是朋友。三次元，只要你不黑我二次元我们还是朋友。三次元，只要你不毁我信仰我们还朋友。三次元，只要你别不懂装懂我们还是朋友。三次元，永远不要黑我的本命否则我会定会让你好看，说到做到",
        "世上最远的距离，无非是我对着屏幕上的你伸出手，你却强忍着哭泣说：“对不起，我是活在二次元的女孩……",
        "为二次元献出心脏！我只能渐渐麻木自己，呆在二次元的世界里。被三次元的朋友嘲笑幼稚，被鄙视，被当做另类的时候，我的心曾动摇过。但是我是不会离开这里，这里有我最爱的动漫。最爱的基友，这是三次元没有的。我不想出来，外面的时间太可怕。人心太可怕了！每次在这里疯狂的转载漫图说说动态。坐在家里每日没夜的看动漫，在动漫群和基友聊天。就会忘记所有不开心的事！这里是没有烦恼的世界。这里是我最爱的家，如果有人敢破坏它，我必拼尽一切保护它! ——愿为二次元献出心脏！",
        "有一位歌手叫初音\n有一种病娇叫由乃\n有一种游戏叫SAO\n有一种温柔叫夏目\n有一种节操叫银桑\n有一种恶魔叫384\n有一种尼桑叫艾斯\n有一种友谊叫轻音\n有一种性别叫秀吉\n有一种坚持叫三井\n有一名侦探叫柯南\n有一种静候叫张起灵\n有一种身高叫一米六\n有一个喰种叫金木\n有一个世界叫二次元",
    };
};