#pragma once
#include <cqcppsdk/cqcppsdk.h>
#include <iostream>

namespace Greeting{
    const int ZuAn_size=18;
    std::string ZuAn[18]={
    "你妈生你那天，你爹一个都没来",
    "去拼多多拼个马再来跟我说话",
    "几个马呀说话这么嚣张",
    "以后给你马打电话你先挂，别让你马挂了",
    "我和我的猫还有你的马都很想你，骗你的啦，其实我没有猫，你也没有马",
    "你马今晚八次爆炸，照亮整个台湾海峡，组成爱我中华",
    "你和你妈散步，你要先走，要不然你妈就走了",
    "你问我有多强？祖安三年有爹娘",
    "常往天上看看，说不定你马也在看你",
    "东边不亮西边亮，你爹啥样我啥样",
    "你自言自语半天，你是跟你马念往生咒还是再给你全家念大悲咒?",
    "我的世界我做主，指手画脚马入土",
    "鼠牛虎兔龙蛇羊猴鸡狗猪 你看看少了什么 你马没了",
    "火葬场打来电话说你马粘锅了",
    "一杯焦糖玛奇朵，有焦糖和奇朵，你马呢?",
    "卢本伟牛逼卢本伟牛逼卢本伟牛逼",
    "给阿姨倒一杯卡布奇诺",
    "你好，旅行者"
    };
};